In [3]:
import pandas  as pd


#pandas에서 인덱스를 따로 잡아주지 않으면 자동으로 숫자로 잡힘
a=[10, 20, 30, 40, 50]
sri1= pd.Series(a, index=['a', 'b', 'c', 'd', 'e'])
print(sri1)
print(sri1.index)
print(sri1.values)
print(sri1.value_counts)
print(sri1.dtype)

a    10
b    20
c    30
d    40
e    50
dtype: int64
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
[10 20 30 40 50]
<bound method IndexOpsMixin.value_counts of a    10
b    20
c    30
d    40
e    50
dtype: int64>
int64

In [4]:
b={'홍길동':70, '홍길순':80, '홍길자':90}
s1= pd.Series(b)
s1.index['dong', 'sun', 'ja']
print(s1)

IndexError: only integers, slices (`:`), ellipsis (`...`), numpy.newaxis (`None`) and integer or boolean arrays are valid indices

In [5]:
names = ['kim', 'lee', 'choi', 'park', 'jung']
years = [2013, 2014, 2013, 2015, 2014]
points =[1.5, 1.7, 3.6, 2.4, 2.9]

data={'name':names, 'year':years, 'point': points}
df=pd.DataFrame(data, index=['one', 'two', 'three', 'four', 'five'])
df

       name  year  point
one     kim  2013    1.5
two     lee  2014    1.7
three  choi  2013    3.6
four   park  2015    2.4
five   jung  2014    2.9

In [6]:
data=[names, years, points]
df1=pd.DataFrame(data).T
df1.columns=['name', 'year', 'point']
df1.index=['일', '이', '삼', '사', '오']

df1

   name  year point
일   kim  2013   1.5
이   lee  2014   1.7
삼  choi  2013   3.6
사  park  2015   2.4
오  jung  2014   2.9

In [7]:
df1.info()
df1['point']=df1['point'].astype('float32')
df1['year']=df1['year'].astype('int64')
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 일 to 오
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   year    5 non-null      object
 2   point   5 non-null      object
dtypes: object(3)
memory usage: 160.0+ bytes
<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 일 to 오
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   year    5 non-null      int64
 2   point   5 non-null      float32
dtypes: float32(1), int64(1), object(1)
memory usage: 140.0+ bytes

In [8]:
df2=df1[['year', 'point']]
#describe = 통계요약정보
df2.describe()
# df2.info()
#Transpose하면 object로 변경되는게 있으니 참조하면됨

             year     point
count     5.00000  5.000000
mean   2013.80000  2.420000
std       0.83666  0.864292
min    2013.00000  1.500000
25%    2013.00000  1.700000
50%    2014.00000  2.400000
75%    2014.00000  2.900000
max    2015.00000  3.600000

In [12]:
name1 = df.name
name2 = df['name']
print(name1)
print(name2.to_list())

df[['name', 'point']]

one       kim
two       lee
three    choi
four     park
five     jung
Name: name, dtype: object
['kim', 'lee', 'choi', 'park', 'jung']
<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, one to five
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   year    5 non-null      int64
 2   point   5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 160.0+ bytes

In [69]:
#열 삽입하려고 할때 하나씩 다 값을 지정해줘야함
# df['들어갈열 이름'] = [들어가는값]
# df['penalty']=[0.5, 0.1, 0.3, 0.2, 0.4]
df['aa'] = [1,2,3,4,5]
print(df['aa']);
print(df.aa)
df

one      1
two      2
three    3
four     4
five     5
Name: aa, dtype: int64
[1, 2, 3, 4, 5]

       name  year  point  penalty  aa
one     kim  2013    1.5      0.5   1
two     lee  2014    1.7      0.1   2
three  choi  2013    3.6      0.3   3
four   park  2015    2.4      0.2   4
five   jung  2014    2.9      0.4   5

In [33]:
import numpy as np

df['bb'] = [1.0, None, 2.0, np.nan, 4.0]; df
# df.dropna(how='any'); #<- 적용안됨 원래 작성된 폼의 것은 자신의 폼에서는 삭제가 불가능하고 이름을 바꿔야 가능
# df2= df.dropna(how='any');
df3= df.fillna(value=0.5)
df3

       name  year  point  penalty  aa   bb
one     kim  2013    1.5      0.5   1  1.0
two     lee  2014    1.7      0.1   2  NaN
three  choi  2013    3.6      0.3   3  2.0
four   park  2015    2.4      0.2   4  NaN
five   jung  2014    2.9      0.4   5  4.0

In [55]:
df.aa
#행의 값을 가져오는 방법
df.loc['one']
# #두개는 같은 값을 가져옴
df.loc[['one', 'four']]
df.loc['one':'four',['name','point','year']] #<-컬럼은순서가 없음

df.iloc[0:3, 0:3]  #<-3(0~2)*3(0~2)으로 출력하게 하는것

df.loc[df['point']>2.5,:] #point가 2.5이상인것만 출력하게 하는 것

       name  year  point
one     kim  2013    1.5
two     lee  2014    1.7
three  choi  2013    3.6

In [78]:
df5= df.drop(['one', 'four']); df5
# del df['bb']; df
#axis=0 ->행삭제
#axis=1 ->열 삭제
# df

       name  year  point  penalty  aa
two     lee  2014    1.7      0.1   2
three  choi  2013    3.6      0.3   3
five   jung  2014    2.9      0.4   5

In [88]:
kors=[80,75,60,70,95]
engs=[85,70,65,75,90]
maths=[80,75,70,65,85]
data={'name':names, 'kor':kors, 'eng':engs, 'math':maths}

df= pd.DataFrame(data, index=['a', 'b', 'c', 'd', 'e'])
df
df.sum(axis=1)
df.max(axis=0)

C:\Users\it\AppData\Local\Temp\ipykernel_2900\3516170217.py:8: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(axis=1)

name    park
kor       95
eng       90
math      85
dtype: object

In [93]:
df['class']=['A', 'B', 'B', 'A', 'A']
df['total']=df.kor+df.eng+df.math
df

   name  kor  eng  math class  total
a   kim   80   85    80     A    245
b   lee   75   70    75     B    220
c  choi   60   65    70     B    195
d  park   70   75    65     A    210
e  jung   95   90    85     A    270

In [97]:
print(df.groupby('class').mean())
print(df.groupby('class')['total'].mean())

             kor        eng       math       total
class
A      81.666667  83.333333  76.666667  241.666667
B      67.500000  67.500000  72.500000  207.500000
class
A    241.666667
B    207.500000
Name: total, dtype: float64

C:\Users\it\AppData\Local\Temp\ipykernel_2900\2656919400.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  print(df.groupby('class').mean())